# models/yolov11-p2-gca.yaml
# YOLOv11 魔改版：针对无人机视角优化 (引入 P2 小目标层 + GCA 全局上下文)

# 定义默认参数
nc: 80 # 类别数量 (后续在训练时会自动被数据配置文件中的类别数覆盖)
scales: # 模型规模 [depth, width, max_channels]
  s: [0.33, 0.50, 1024] # 我们选用 Small 规模作为 Baseline，适合 Orin 部署

# ----------------- Backbone (主干网络，用于提取特征) -----------------
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2  (下采样2倍)
  - [-1, 1, Conv,[128, 3, 2]]     # 1-P2/4  (下采样4倍) -> 我们一会儿要用到这层
  - [-1, 2, C3k2,[256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8  (下采样8倍)
  - [-1, 2, C3k2,[512, False, 0.25]] # 4
  - [-1, 1, Conv,[512, 3, 2]]     # 5-P4/16 (下采样16倍)
  - [-1, 2, C3k2, [512, True]]     # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32 (下采样32倍)
  - [-1, 2, C3k2,[1024, True]]    # 8
  - [-1, 1, SPPF,[1024, 5]]       # 9
  - [-1, 1, C2PSA,[1024]]         # 10
  # 创新点：在 Backbone 最后一层加入我们手写的 GCA 模块，感知全局上下文
  - [-1, 1, GlobalContextAttention, []] # 11 (自定义层)

# ----------------- Head (检测头，负责融合特征并输出预测) -----------------
head:
  - [-1, 1, nn.Upsample,[None, 2, "nearest"]] # 12 上采样至 P4 分辨率
  - [[-1, 6], 1, Concat, [1]] # 13 融合 Backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15 上采样至 P3 分辨率
  - [[-1, 4], 1, Concat, [1]] # 16 融合 Backbone P3
  - [-1, 2, C3k2, [256, False]] # 17 (通常 YOLO 在这里就结束向上了)

  # 创新点：继续上采样至 P2 分辨率 (针对极小目标)
  - [-1, 1, nn.Upsample,[None, 2, "nearest"]] # 18 上采样至 P2
  - [[-1, 2], 1, Concat, [1]] # 19 融合 Backbone P2 (第2层)
  - [-1, 2, C3k2, [128, False]] # 20 (这就是 P2 层的高清特征)

  # 开始向下融合 (PANet 结构)
  - [-1, 1, Conv, [128, 3, 2]] # 21 下采样
  - [[-1, 17], 1, Concat, [1]] # 22
  - [-1, 2, C3k2, [256, False]] # 23 (P3)

  - [-1, 1, Conv, [256, 3, 2]] # 24 下采样
  - [[-1, 14], 1, Concat, [1]] # 25
  - [-1, 2, C3k2, [512, False]] # 26 (P4)

  - [-1, 1, Conv,[512, 3, 2]] # 27 下采样
  - [[-1, 11], 1, Concat, [1]] # 28
  - [-1, 2, C3k2, [1024, True]] # 29 (P5)

  # 💡 创新点：把 P2, P3, P4, P5 四个尺度的特征图一起送入检测头！
  - [[20, 23, 26, 29], 1, Detect, [nc]] # 30